/* errAuthorizationSuccess */
"0" = "errAuthorizationSuccess";

/* errAuthorizationInvalidSet */
"-60001" = "The authorization rights are invalid.";

/* errAuthorizationInvalidRef */
"-60002" = "The authorization reference is invalid.";

/* errAuthorizationInvalidTag */
"-60003" = "The authorization tag is invalid.";

/* errAuthorizationInvalidPointer */
"-60004" = "The returned authorization is invalid.";

/* errAuthorizationDenied */
"-60005" = "The authorization was denied.";

/* errAuthorizationCanceled */
"-60006" = "The authorization was cancelled by the user.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "The authorization was denied since no user interaction was possible.";

/* errAuthorizationInternal */
"-60008" = "Unable to obtain authorization for this operation.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "The authorization is not allowed to be converted to an external format.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "The authorization is not allowed to be created from an external format.";

/* errAuthorizationInvalidFlags */
"-60011" = "The provided option flag(s) are invalid for this authorization operation.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "The specified program could not be executed.";

/* errAuthorizationToolEnvironmentError */
"-60032" = "An invalid status was returned during execution of a privileged tool.";

/* errAuthorizationBadAddress */
"-60033" = "The requested socket address is invalid (must be 0-1023 inclusive).";

/* errSSLProtocol */
"-9800" = "SSL protocol error";

/* errSSLNegotiation */
"-9801" = "Cipher Suite negotiation failure";

/* errSSLFatalAlert */
"-9802" = "Fatal alert";

/* errSSLWouldBlock */
"-9803" = "I/O would block (not fatal)";

/* errSSLSessionNotFound */
"-9804" = "attempt to restore an unknown session";

/* errSSLClosedGraceful */
"-9805" = "connection closed gracefully";

/* errSSLClosedAbort */
"-9806" = "connection closed via error";

/* errSSLXCertChainInvalid */
"-9807" = "invalid certificate chain";

/* errSSLBadCert */
"-9808" = "bad certificate format";

/* errSSLCrypto */
"-9809" = "underlying cryptographic error";

/* errSSLInternal */
"-9810" = "Internal error";

/* errSSLModuleAttach */
"-9811" = "module attach failure";

/* errSSLUnknownRootCert */
"-9812" = "valid cert chain, untrusted root";

/* errSSLNoRootCert */
"-9813" = "cert chain not verified by root";

/* errSSLCertExpired */
"-9814" = "chain had an expired cert";

/* errSSLCertNotYetValid */
"-9815" = "chain had a cert not yet valid";

/* errSSLClosedNoNotify */
"-9816" = "server closed session with no notification";

/* errSSLBufferOverflow */
"-9817" = "insufficient buffer provided";

/* errSSLBadCipherSuite */
"-9818" = "bad SSLCipherSuite";

/* errSSLPeerUnexpectedMsg */
"-9819" = "unexpected message received";

/* errSSLPeerBadRecordMac */
"-9820" = "bad MAC";

/* errSSLPeerDecryptionFail */
"-9821" = "decryption failed";

/* errSSLPeerRecordOverflow */
"-9822" = "record overflow";

/* errSSLPeerDecompressFail */
"-9823" = "decompression failure";

/* errSSLPeerHandshakeFail */
"-9824" = "handshake failure";

/* errSSLPeerBadCert */
"-9825" = "misc. bad certificate";

/* errSSLPeerUnsupportedCert */
"-9826" = "bad unsupported cert format";

/* errSSLPeerCertRevoked */
"-9827" = "certificate revoked";

/* errSSLPeerCertExpired */
"-9828" = "certificate expired";

/* errSSLPeerCertUnknown */
"-9829" = "unknown certificate";

/* errSSLIllegalParam */
"-9830" = "illegal parameter";

/* errSSLPeerUnknownCA */
"-9831" = "unknown Cert Authority";

/* errSSLPeerAccessDenied */
"-9832" = "access denied";

/* errSSLPeerDecodeError */
"-9833" = "decoding error";

/* errSSLPeerDecryptError */
"-9834" = "decryption error";

/* errSSLPeerExportRestriction */
"-9835" = "export restriction";

/* errSSLPeerProtocolVersion */
"-9836" = "bad protocol version";

/* errSSLPeerInsufficientSecurity */
"-9837" = "insufficient security";

/* errSSLPeerInternalError */
"-9838" = "internal error";

/* errSSLPeerUserCancelled */
"-9839" = "user canceled";

/* errSSLPeerNoRenegotiation */
"-9840" = "no renegotiation allowed";

/* errSSLServerAuthCompleted */
"-9841" = "server cert is valid, or was ignored if verification disabled";

/* errSSLClientCertRequested */
"-9842" = "server has requested a client cert";

/* errSSLHostNameMismatch */
"-9843" = "peer host name mismatch";

/* errSSLConnectionRefused */
"-9844" = "peer dropped connection before responding";

/* errSSLDecryptionFail */
"-9845" = "decryption failure";

/* errSSLBadRecordMac */
"-9846" = "bad MAC";

/* errSSLRecordOverflow */
"-9847" = "record overflow";

/* errSSLBadConfiguration */
"-9848" = "configuration error";

/* errSSLLast */
"-9849" = "errSSLLast";

/* errSecSuccess */
"0" = "No error.";

/* errSecUnimplemented */
"-4" = "Function or operation not implemented.";

/* errSecParam */
"-50" = "One or more parameters passed to a function were not valid.";

/* errSecAllocate */
"-108" = "Failed to allocate memory.";

/* errSecNotAvailable */
"-25291" = "No keychain is available. You may need to restart your computer.";

/* errSecReadOnly */
"-25292" = "This keychain cannot be modified.";

/* errSecAuthFailed */
"-25293" = "The user name or passphrase you entered is not correct.";

/* errSecNoSuchKeychain */
"-25294" = "The specified keychain could not be found.";

/* errSecInvalidKeychain */
"-25295" = "The specified keychain is not a valid keychain file.";

/* errSecDuplicateKeychain */
"-25296" = "A keychain with the same name already exists.";

/* errSecDuplicateCallback */
"-25297" = "The specified callback function is already installed.";

/* errSecInvalidCallback */
"-25298" = "The specified callback function is not valid.";

/* errSecDuplicateItem */
"-25299" = "The specified item already exists in the keychain.";

/* errSecItemNotFound */
"-25300" = "The specified item could not be found in the keychain.";

/* errSecBufferTooSmall */
"-25301" = "There is not enough memory available to use the specified item.";

/* errSecDataTooLarge */
"-25302" = "This item contains information which is too large or in a format that cannot be displayed.";

/* errSecNoSuchAttr */
"-25303" = "The specified attribute does not exist.";

/* errSecInvalidItemRef */
"-25304" = "The specified item is no longer valid. It may have been deleted from the keychain.";

/* errSecInvalidSearchRef */
"-25305" = "Unable to search the current keychain.";

/* errSecNoSuchClass */
"-25306" = "The specified item does not appear to be a valid keychain item.";

/* errSecNoDefaultKeychain */
"-25307" = "A default keychain could not be found.";

/* errSecInteractionNotAllowed */
"-25308" = "User interaction is not allowed.";

/* errSecReadOnlyAttr */
"-25309" = "The specified attribute could not be modified.";

/* errSecWrongSecVersion */
"-25310" = "This keychain was created by a different version of the system software and cannot be opened.";

/* errSecKeySizeNotAllowed */
"-25311" = "This item specifies a key size which is too large.";

/* errSecNoStorageModule */
"-25312" = "A required component (data storage module) could not be loaded. You may need to restart your computer.";

/* errSecNoCertificateModule */
"-25313" = "A required component (certificate module) could not be loaded. You may need to restart your computer.";

/* errSecNoPolicyModule */
"-25314" = "A required component (policy module) could not be loaded. You may need to restart your computer.";

/* errSecInteractionRequired */
"-25315" = "User interaction is required, but is currently not allowed.";

/* errSecDataNotAvailable */
"-25316" = "The contents of this item cannot be retrieved.";

/* errSecDataNotModifiable */
"-25317" = "The contents of this item cannot be modified.";

/* errSecCreateChainFailed */
"-25318" = "One or more certificates required to validate this certificate cannot be found.";

/* errSecInvalidPrefsDomain */
"-25319" = "The specified preferences domain is not valid.";

/* errSecACLNotSimple */
"-25240" = "The specified access control list is not in standard (simple) form.";

/* errSecPolicyNotFound */
"-25241" = "The specified policy cannot be found.";

/* errSecInvalidTrustSetting */
"-25242" = "The specified trust setting is invalid.";

/* errSecNoAccessForItem */
"-25243" = "The specified item has no access control.";

/* errSecInvalidOwnerEdit */
"-25244" = "Invalid attempt to change the owner of this item.";

/* errSecTrustNotAvailable */
"-25245" = "No trust results are available.";

/* errSecUnsupportedFormat */
"-25256" = "Import/Export format unsupported.";

/* errSecUnknownFormat */
"-25257" = "Unknown format in import.";

/* errSecKeyIsSensitive */
"-25258" = "Key material must be wrapped for export.";

/* errSecMultiplePrivKeys */
"-25259" = "An attempt was made to import multiple private keys.";

/* errSecPassphraseRequired */
"-25260" = "Passphrase is required for import/export.";

/* errSecInvalidPasswordRef */
"-25261" = "The password reference was invalid.";

/* errSecInvalidTrustSettings */
"-25262" = "The Trust Settings Record was corrupted.";

/* errSecNoTrustSettings */
"-25263" = "No Trust Settings were found.";

/* errSecPkcs12VerifyFailure */
"-25264" = "MAC verification failed during PKCS12 Import.";

/* errSecDecode */
"-26275" = "Unable to decode the provided data.";

/* CSSMERR_CSSM_INVALID_ADDIN_HANDLE */
"-2147417855" = "CSSMERR_CSSM_INVALID_ADDIN_HANDLE";

/* CSSMERR_CSSM_NOT_INITIALIZED */
"-2147417854" = "CSSMERR_CSSM_NOT_INITIALIZED";

/* CSSMERR_CSSM_INVALID_HANDLE_USAGE */
"-2147417853" = "CSSMERR_CSSM_INVALID_HANDLE_USAGE";

/* CSSMERR_CSSM_PVC_REFERENT_NOT_FOUND */
"-2147417852" = "CSSMERR_CSSM_PVC_REFERENT_NOT_FOUND";

/* CSSMERR_CSSM_FUNCTION_INTEGRITY_FAIL */
"-2147417851" = "CSSMERR_CSSM_FUNCTION_INTEGRITY_FAIL";

/* CSSM_ERRCODE_INTERNAL_ERROR */
"1" = "CSSM_ERRCODE_INTERNAL_ERROR";

/* CSSM_ERRCODE_MEMORY_ERROR */
"2" = "CSSM_ERRCODE_MEMORY_ERROR";

/* CSSM_ERRCODE_MDS_ERROR */
"3" = "CSSM_ERRCODE_MDS_ERROR";

/* CSSM_ERRCODE_INVALID_POINTER */
"4" = "CSSM_ERRCODE_INVALID_POINTER";

/* CSSM_ERRCODE_INVALID_INPUT_POINTER */
"5" = "CSSM_ERRCODE_INVALID_INPUT_POINTER";

/* CSSM_ERRCODE_INVALID_OUTPUT_POINTER */
"6" = "CSSM_ERRCODE_INVALID_OUTPUT_POINTER";

/* CSSM_ERRCODE_FUNCTION_NOT_IMPLEMENTED */
"7" = "CSSM_ERRCODE_FUNCTION_NOT_IMPLEMENTED";

/* CSSM_ERRCODE_SELF_CHECK_FAILED */
"8" = "CSSM_ERRCODE_SELF_CHECK_FAILED";

/* CSSM_ERRCODE_OS_ACCESS_DENIED */
"9" = "CSSM_ERRCODE_OS_ACCESS_DENIED";

/* CSSM_ERRCODE_FUNCTION_FAILED */
"10" = "CSSM_ERRCODE_FUNCTION_FAILED";

/* CSSM_ERRCODE_MODULE_MANIFEST_VERIFY_FAILED */
"11" = "CSSM_ERRCODE_MODULE_MANIFEST_VERIFY_FAILED";

/* CSSM_ERRCODE_INVALID_GUID */
"12" = "CSSM_ERRCODE_INVALID_GUID";

/* CSSM_ERRCODE_OPERATION_AUTH_DENIED */
"32" = "CSSM_ERRCODE_OPERATION_AUTH_DENIED";

/* CSSM_ERRCODE_OBJECT_USE_AUTH_DENIED */
"33" = "CSSM_ERRCODE_OBJECT_USE_AUTH_DENIED";

/* CSSM_ERRCODE_OBJECT_MANIP_AUTH_DENIED */
"34" = "CSSM_ERRCODE_OBJECT_MANIP_AUTH_DENIED";

/* CSSM_ERRCODE_OBJECT_ACL_NOT_SUPPORTED */
"35" = "CSSM_ERRCODE_OBJECT_ACL_NOT_SUPPORTED";

/* CSSM_ERRCODE_OBJECT_ACL_REQUIRED */
"36" = "CSSM_ERRCODE_OBJECT_ACL_REQUIRED";

/* CSSM_ERRCODE_INVALID_ACCESS_CREDENTIALS */
"37" = "CSSM_ERRCODE_INVALID_ACCESS_CREDENTIALS";

/* CSSM_ERRCODE_INVALID_ACL_BASE_CERTS */
"38" = "CSSM_ERRCODE_INVALID_ACL_BASE_CERTS";

/* CSSM_ERRCODE_ACL_BASE_CERTS_NOT_SUPPORTED */
"39" = "CSSM_ERRCODE_ACL_BASE_CERTS_NOT_SUPPORTED";

/* CSSM_ERRCODE_INVALID_SAMPLE_VALUE */
"40" = "CSSM_ERRCODE_INVALID_SAMPLE_VALUE";

/* CSSM_ERRCODE_SAMPLE_VALUE_NOT_SUPPORTED */
"41" = "CSSM_ERRCODE_SAMPLE_VALUE_NOT_SUPPORTED";

/* CSSM_ERRCODE_INVALID_ACL_SUBJECT_VALUE */
"42" = "CSSM_ERRCODE_INVALID_ACL_SUBJECT_VALUE";

/* CSSM_ERRCODE_ACL_SUBJECT_TYPE_NOT_SUPPORTED */
"43" = "CSSM_ERRCODE_ACL_SUBJECT_TYPE_NOT_SUPPORTED";

/* CSSM_ERRCODE_INVALID_ACL_CHALLENGE_CALLBACK */
"44" = "CSSM_ERRCODE_INVALID_ACL_CHALLENGE_CALLBACK";

/* CSSM_ERRCODE_ACL_CHALLENGE_CALLBACK_FAILED */
"45" = "CSSM_ERRCODE_ACL_CHALLENGE_CALLBACK_FAILED";

/* CSSM_ERRCODE_INVALID_ACL_ENTRY_TAG */
"46" = "CSSM_ERRCODE_INVALID_ACL_ENTRY_TAG";

/* CSSM_ERRCODE_ACL_ENTRY_TAG_NOT_FOUND */
"47" = "CSSM_ERRCODE_ACL_ENTRY_TAG_NOT_FOUND";

/* CSSM_ERRCODE_INVALID_ACL_EDIT_MODE */
"48" = "CSSM_ERRCODE_INVALID_ACL_EDIT_MODE";

/* CSSM_ERRCODE_ACL_CHANGE_FAILED */
"49" = "CSSM_ERRCODE_ACL_CHANGE_FAILED";

/* CSSM_ERRCODE_INVALID_NEW_ACL_ENTRY */
"50" = "CSSM_ERRCODE_INVALID_NEW_ACL_ENTRY";

/* CSSM_ERRCODE_INVALID_NEW_ACL_OWNER */
"51" = "CSSM_ERRCODE_INVALID_NEW_ACL_OWNER";

/* CSSM_ERRCODE_ACL_DELETE_FAILED */
"52" = "CSSM_ERRCODE_ACL_DELETE_FAILED";

/* CSSM_ERRCODE_ACL_REPLACE_FAILED */
"53" = "CSSM_ERRCODE_ACL_REPLACE_FAILED";

/* CSSM_ERRCODE_ACL_ADD_FAILED */
"54" = "CSSM_ERRCODE_ACL_ADD_FAILED";

/* CSSM_ERRCODE_INVALID_CONTEXT_HANDLE */
"64" = "CSSM_ERRCODE_INVALID_CONTEXT_HANDLE";

/* CSSM_ERRCODE_INCOMPATIBLE_VERSION */
"65" = "CSSM_ERRCODE_INCOMPATIBLE_VERSION";

/* CSSM_ERRCODE_INVALID_CERTGROUP_POINTER */
"66" = "CSSM_ERRCODE_INVALID_CERTGROUP_POINTER";

/* CSSM_ERRCODE_INVALID_CERT_POINTER */
"67" = "CSSM_ERRCODE_INVALID_CERT_POINTER";

/* CSSM_ERRCODE_INVALID_CRL_POINTER */
"68" = "CSSM_ERRCODE_INVALID_CRL_POINTER";

/* CSSM_ERRCODE_INVALID_FIELD_POINTER */
"69" = "CSSM_ERRCODE_INVALID_FIELD_POINTER";

/* CSSM_ERRCODE_INVALID_DATA */
"70" = "CSSM_ERRCODE_INVALID_DATA";

/* CSSM_ERRCODE_CRL_ALREADY_SIGNED */
"71" = "CSSM_ERRCODE_CRL_ALREADY_SIGNED";

/* CSSM_ERRCODE_INVALID_NUMBER_OF_FIELDS */
"72" = "CSSM_ERRCODE_INVALID_NUMBER_OF_FIELDS";

/* CSSM_ERRCODE_VERIFICATION_FAILURE */
"73" = "CSSM_ERRCODE_VERIFICATION_FAILURE";

/* CSSM_ERRCODE_INVALID_DB_HANDLE */
"74" = "CSSM_ERRCODE_INVALID_DB_HANDLE";

/* CSSM_ERRCODE_PRIVILEGE_NOT_GRANTED */
"75" = "CSSM_ERRCODE_PRIVILEGE_NOT_GRANTED";

/* CSSM_ERRCODE_INVALID_DB_LIST */
"76" = "CSSM_ERRCODE_INVALID_DB_LIST";

/* CSSM_ERRCODE_INVALID_DB_LIST_POINTER */
"77" = "CSSM_ERRCODE_INVALID_DB_LIST_POINTER";

/* CSSM_ERRCODE_UNKNOWN_FORMAT */
"78" = "CSSM_ERRCODE_UNKNOWN_FORMAT";

/* CSSM_ERRCODE_UNKNOWN_TAG */
"79" = "CSSM_ERRCODE_UNKNOWN_TAG";

/* CSSM_ERRCODE_INVALID_CSP_HANDLE */
"80" = "CSSM_ERRCODE_INVALID_CSP_HANDLE";

/* CSSM_ERRCODE_INVALID_DL_HANDLE */
"81" = "CSSM_ERRCODE_INVALID_DL_HANDLE";

/* CSSM_ERRCODE_INVALID_CL_HANDLE */
"82" = "CSSM_ERRCODE_INVALID_CL_HANDLE";

/* CSSM_ERRCODE_INVALID_TP_HANDLE */
"83" = "CSSM_ERRCODE_INVALID_TP_HANDLE";

/* CSSM_ERRCODE_INVALID_KR_HANDLE */
"84" = "CSSM_ERRCODE_INVALID_KR_HANDLE";

/* CSSM_ERRCODE_INVALID_AC_HANDLE */
"85" = "CSSM_ERRCODE_INVALID_AC_HANDLE";

/* CSSM_ERRCODE_INVALID_PASSTHROUGH_ID */
"86" = "CSSM_ERRCODE_INVALID_PASSTHROUGH_ID";

/* CSSM_ERRCODE_INVALID_NETWORK_ADDR */
"87" = "CSSM_ERRCODE_INVALID_NETWORK_ADDR";

/* CSSM_ERRCODE_INVALID_CRYPTO_DATA */
"88" = "CSSM_ERRCODE_INVALID_CRYPTO_DATA";

/* CSSMERR_CSSM_INTERNAL_ERROR */
"-2147418111" = "CSSMERR_CSSM_INTERNAL_ERROR";

/* CSSMERR_CSSM_MEMORY_ERROR */
"-2147418110" = "CSSMERR_CSSM_MEMORY_ERROR";

/* CSSMERR_CSSM_MDS_ERROR */
"-2147418109" = "CSSMERR_CSSM_MDS_ERROR";

/* CSSMERR_CSSM_INVALID_POINTER */
"-2147418108" = "CSSMERR_CSSM_INVALID_POINTER";

/* CSSMERR_CSSM_INVALID_INPUT_POINTER */
"-2147418107" = "CSSMERR_CSSM_INVALID_INPUT_POINTER";

/* CSSMERR_CSSM_INVALID_OUTPUT_POINTER */
"-2147418106" = "CSSMERR_CSSM_INVALID_OUTPUT_POINTER";

/* CSSMERR_CSSM_FUNCTION_NOT_IMPLEMENTED */
"-2147418105" = "CSSMERR_CSSM_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_CSSM_SELF_CHECK_FAILED */
"-2147418104" = "CSSMERR_CSSM_SELF_CHECK_FAILED";

/* CSSMERR_CSSM_OS_ACCESS_DENIED */
"-2147418103" = "CSSMERR_CSSM_OS_ACCESS_DENIED";

/* CSSMERR_CSSM_FUNCTION_FAILED */
"-2147418102" = "CSSMERR_CSSM_FUNCTION_FAILED";

/* CSSMERR_CSSM_MODULE_MANIFEST_VERIFY_FAILED */
"-2147418101" = "CSSMERR_CSSM_MODULE_MANIFEST_VERIFY_FAILED";

/* CSSMERR_CSSM_INVALID_GUID */
"-2147418100" = "CSSMERR_CSSM_INVALID_GUID";

/* CSSMERR_CSSM_INVALID_CONTEXT_HANDLE */
"-2147418048" = "CSSMERR_CSSM_INVALID_CONTEXT_HANDLE";

/* CSSMERR_CSSM_INCOMPATIBLE_VERSION */
"-2147418047" = "CSSMERR_CSSM_INCOMPATIBLE_VERSION";

/* CSSMERR_CSSM_PRIVILEGE_NOT_GRANTED */
"-2147418037" = "CSSMERR_CSSM_PRIVILEGE_NOT_GRANTED";

/* CSSMERR_CSSM_SCOPE_NOT_SUPPORTED */
"-2147417839" = "CSSMERR_CSSM_SCOPE_NOT_SUPPORTED";

/* CSSMERR_CSSM_PVC_ALREADY_CONFIGURED */
"-2147417838" = "CSSMERR_CSSM_PVC_ALREADY_CONFIGURED";

/* CSSMERR_CSSM_INVALID_PVC */
"-2147417837" = "CSSMERR_CSSM_INVALID_PVC";

/* CSSMERR_CSSM_EMM_LOAD_FAILED */
"-2147417836" = "CSSMERR_CSSM_EMM_LOAD_FAILED";

/* CSSMERR_CSSM_EMM_UNLOAD_FAILED */
"-2147417835" = "CSSMERR_CSSM_EMM_UNLOAD_FAILED";

/* CSSMERR_CSSM_ADDIN_LOAD_FAILED */
"-2147417834" = "CSSMERR_CSSM_ADDIN_LOAD_FAILED";

/* CSSMERR_CSSM_INVALID_KEY_HIERARCHY */
"-2147417833" = "CSSMERR_CSSM_INVALID_KEY_HIERARCHY";

/* CSSMERR_CSSM_ADDIN_UNLOAD_FAILED */
"-2147417832" = "CSSMERR_CSSM_ADDIN_UNLOAD_FAILED";

/* CSSMERR_CSSM_LIB_REF_NOT_FOUND */
"-2147417831" = "CSSMERR_CSSM_LIB_REF_NOT_FOUND";

/* CSSMERR_CSSM_INVALID_ADDIN_FUNCTION_TABLE */
"-2147417830" = "CSSMERR_CSSM_INVALID_ADDIN_FUNCTION_TABLE";

/* CSSMERR_CSSM_EMM_AUTHENTICATE_FAILED */
"-2147417829" = "CSSMERR_CSSM_EMM_AUTHENTICATE_FAILED";

/* CSSMERR_CSSM_ADDIN_AUTHENTICATE_FAILED */
"-2147417828" = "CSSMERR_CSSM_ADDIN_AUTHENTICATE_FAILED";

/* CSSMERR_CSSM_INVALID_SERVICE_MASK */
"-2147417827" = "CSSMERR_CSSM_INVALID_SERVICE_MASK";

/* CSSMERR_CSSM_MODULE_NOT_LOADED */
"-2147417826" = "CSSMERR_CSSM_MODULE_NOT_LOADED";

/* CSSMERR_CSSM_INVALID_SUBSERVICEID */
"-2147417825" = "CSSMERR_CSSM_INVALID_SUBSERVICEID";

/* CSSMERR_CSSM_BUFFER_TOO_SMALL */
"-2147417824" = "CSSMERR_CSSM_BUFFER_TOO_SMALL";

/* CSSMERR_CSSM_INVALID_ATTRIBUTE */
"-2147417823" = "CSSMERR_CSSM_INVALID_ATTRIBUTE";

/* CSSMERR_CSSM_ATTRIBUTE_NOT_IN_CONTEXT */
"-2147417822" = "CSSMERR_CSSM_ATTRIBUTE_NOT_IN_CONTEXT";

/* CSSMERR_CSSM_MODULE_MANAGER_INITIALIZE_FAIL */
"-2147417821" = "CSSMERR_CSSM_MODULE_MANAGER_INITIALIZE_FAIL";

/* CSSMERR_CSSM_MODULE_MANAGER_NOT_FOUND */
"-2147417820" = "CSSMERR_CSSM_MODULE_MANAGER_NOT_FOUND";

/* CSSMERR_CSSM_EVENT_NOTIFICATION_CALLBACK_NOT_FOUND */
"-2147417819" = "CSSMERR_CSSM_EVENT_NOTIFICATION_CALLBACK_NOT_FOUND";

/* CSSMERR_CSP_INTERNAL_ERROR */
"-2147416063" = "CSSMERR_CSP_INTERNAL_ERROR";

/* CSSMERR_CSP_MEMORY_ERROR */
"-2147416062" = "CSSMERR_CSP_MEMORY_ERROR";

/* CSSMERR_CSP_MDS_ERROR */
"-2147416061" = "CSSMERR_CSP_MDS_ERROR";

/* CSSMERR_CSP_INVALID_POINTER */
"-2147416060" = "CSSMERR_CSP_INVALID_POINTER";

/* CSSMERR_CSP_INVALID_INPUT_POINTER */
"-2147416059" = "CSSMERR_CSP_INVALID_INPUT_POINTER";

/* CSSMERR_CSP_INVALID_OUTPUT_POINTER */
"-2147416058" = "CSSMERR_CSP_INVALID_OUTPUT_POINTER";

/* CSSMERR_CSP_FUNCTION_NOT_IMPLEMENTED */
"-2147416057" = "CSSMERR_CSP_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_CSP_SELF_CHECK_FAILED */
"-2147416056" = "CSSMERR_CSP_SELF_CHECK_FAILED";

/* CSSMERR_CSP_OS_ACCESS_DENIED */
"-2147416055" = "CSSMERR_CSP_OS_ACCESS_DENIED";

/* CSSMERR_CSP_FUNCTION_FAILED */
"-2147416054" = "CSSMERR_CSP_FUNCTION_FAILED";

/* CSSMERR_CSP_OPERATION_AUTH_DENIED */
"-2147416032" = "CSSMERR_CSP_OPERATION_AUTH_DENIED";

/* CSSMERR_CSP_OBJECT_USE_AUTH_DENIED */
"-2147416031" = "CSSMERR_CSP_OBJECT_USE_AUTH_DENIED";

/* CSSMERR_CSP_OBJECT_MANIP_AUTH_DENIED */
"-2147416030" = "CSSMERR_CSP_OBJECT_MANIP_AUTH_DENIED";

/* CSSMERR_CSP_OBJECT_ACL_NOT_SUPPORTED */
"-2147416029" = "CSSMERR_CSP_OBJECT_ACL_NOT_SUPPORTED";

/* CSSMERR_CSP_OBJECT_ACL_REQUIRED */
"-2147416028" = "CSSMERR_CSP_OBJECT_ACL_REQUIRED";

/* CSSMERR_CSP_INVALID_ACCESS_CREDENTIALS */
"-2147416027" = "CSSMERR_CSP_INVALID_ACCESS_CREDENTIALS";

/* CSSMERR_CSP_INVALID_ACL_BASE_CERTS */
"-2147416026" = "CSSMERR_CSP_INVALID_ACL_BASE_CERTS";

/* CSSMERR_CSP_ACL_BASE_CERTS_NOT_SUPPORTED */
"-2147416025" = "CSSMERR_CSP_ACL_BASE_CERTS_NOT_SUPPORTED";

/* CSSMERR_CSP_INVALID_SAMPLE_VALUE */
"-2147416024" = "CSSMERR_CSP_INVALID_SAMPLE_VALUE";

/* CSSMERR_CSP_SAMPLE_VALUE_NOT_SUPPORTED */
"-2147416023" = "CSSMERR_CSP_SAMPLE_VALUE_NOT_SUPPORTED";

/* CSSMERR_CSP_INVALID_ACL_SUBJECT_VALUE */
"-2147416022" = "CSSMERR_CSP_INVALID_ACL_SUBJECT_VALUE";

/* CSSMERR_CSP_ACL_SUBJECT_TYPE_NOT_SUPPORTED */
"-2147416021" = "CSSMERR_CSP_ACL_SUBJECT_TYPE_NOT_SUPPORTED";

/* CSSMERR_CSP_INVALID_ACL_CHALLENGE_CALLBACK */
"-2147416020" = "CSSMERR_CSP_INVALID_ACL_CHALLENGE_CALLBACK";

/* CSSMERR_CSP_ACL_CHALLENGE_CALLBACK_FAILED */
"-2147416019" = "CSSMERR_CSP_ACL_CHALLENGE_CALLBACK_FAILED";

/* CSSMERR_CSP_INVALID_ACL_ENTRY_TAG */
"-2147416018" = "CSSMERR_CSP_INVALID_ACL_ENTRY_TAG";

/* CSSMERR_CSP_ACL_ENTRY_TAG_NOT_FOUND */
"-2147416017" = "CSSMERR_CSP_ACL_ENTRY_TAG_NOT_FOUND";

/* CSSMERR_CSP_INVALID_ACL_EDIT_MODE */
"-2147416016" = "CSSMERR_CSP_INVALID_ACL_EDIT_MODE";

/* CSSMERR_CSP_ACL_CHANGE_FAILED */
"-2147416015" = "CSSMERR_CSP_ACL_CHANGE_FAILED";

/* CSSMERR_CSP_INVALID_NEW_ACL_ENTRY */
"-2147416014" = "CSSMERR_CSP_INVALID_NEW_ACL_ENTRY";

/* CSSMERR_CSP_INVALID_NEW_ACL_OWNER */
"-2147416013" = "CSSMERR_CSP_INVALID_NEW_ACL_OWNER";

/* CSSMERR_CSP_ACL_DELETE_FAILED */
"-2147416012" = "CSSMERR_CSP_ACL_DELETE_FAILED";

/* CSSMERR_CSP_ACL_REPLACE_FAILED */
"-2147416011" = "CSSMERR_CSP_ACL_REPLACE_FAILED";

/* CSSMERR_CSP_ACL_ADD_FAILED */
"-2147416010" = "CSSMERR_CSP_ACL_ADD_FAILED";

/* CSSMERR_CSP_INVALID_CONTEXT_HANDLE */
"-2147416000" = "CSSMERR_CSP_INVALID_CONTEXT_HANDLE";

/* CSSMERR_CSP_PRIVILEGE_NOT_GRANTED */
"-2147415989" = "CSSMERR_CSP_PRIVILEGE_NOT_GRANTED";

/* CSSMERR_CSP_INVALID_DATA */
"-2147415994" = "CSSMERR_CSP_INVALID_DATA";

/* CSSMERR_CSP_INVALID_PASSTHROUGH_ID */
"-2147415978" = "CSSMERR_CSP_INVALID_PASSTHROUGH_ID";

/* CSSMERR_CSP_INVALID_CRYPTO_DATA */
"-2147415976" = "CSSMERR_CSP_INVALID_CRYPTO_DATA";

/* CSSMERR_CSP_INPUT_LENGTH_ERROR */
"-2147415807" = "CSSMERR_CSP_INPUT_LENGTH_ERROR";

/* CSSMERR_CSP_OUTPUT_LENGTH_ERROR */
"-2147415806" = "CSSMERR_CSP_OUTPUT_LENGTH_ERROR";

/* CSSMERR_CSP_PRIVILEGE_NOT_SUPPORTED */
"-2147415805" = "CSSMERR_CSP_PRIVILEGE_NOT_SUPPORTED";

/* CSSMERR_CSP_DEVICE_ERROR */
"-2147415804" = "CSSMERR_CSP_DEVICE_ERROR";

/* CSSMERR_CSP_DEVICE_MEMORY_ERROR */
"-2147415803" = "CSSMERR_CSP_DEVICE_MEMORY_ERROR";

/* CSSMERR_CSP_ATTACH_HANDLE_BUSY */
"-2147415802" = "CSSMERR_CSP_ATTACH_HANDLE_BUSY";

/* CSSMERR_CSP_NOT_LOGGED_IN */
"-2147415801" = "CSSMERR_CSP_NOT_LOGGED_IN";

/* CSSMERR_CSP_INVALID_KEY */
"-2147415792" = "CSSMERR_CSP_INVALID_KEY";

/* CSSMERR_CSP_INVALID_KEY_REFERENCE */
"-2147415791" = "CSSMERR_CSP_INVALID_KEY_REFERENCE";

/* CSSMERR_CSP_INVALID_KEY_CLASS */
"-2147415790" = "CSSMERR_CSP_INVALID_KEY_CLASS";

/* CSSMERR_CSP_ALGID_MISMATCH */
"-2147415789" = "CSSMERR_CSP_ALGID_MISMATCH";

/* CSSMERR_CSP_KEY_USAGE_INCORRECT */
"-2147415788" = "CSSMERR_CSP_KEY_USAGE_INCORRECT";

/* CSSMERR_CSP_KEY_BLOB_TYPE_INCORRECT */
"-2147415787" = "CSSMERR_CSP_KEY_BLOB_TYPE_INCORRECT";

/* CSSMERR_CSP_KEY_HEADER_INCONSISTENT */
"-2147415786" = "CSSMERR_CSP_KEY_HEADER_INCONSISTENT";

/* CSSMERR_CSP_UNSUPPORTED_KEY_FORMAT */
"-2147415785" = "CSSMERR_CSP_UNSUPPORTED_KEY_FORMAT";

/* CSSMERR_CSP_UNSUPPORTED_KEY_SIZE */
"-2147415784" = "CSSMERR_CSP_UNSUPPORTED_KEY_SIZE";

/* CSSMERR_CSP_INVALID_KEY_POINTER */
"-2147415783" = "CSSMERR_CSP_INVALID_KEY_POINTER";

/* CSSMERR_CSP_INVALID_KEYUSAGE_MASK */
"-2147415782" = "CSSMERR_CSP_INVALID_KEYUSAGE_MASK";

/* CSSMERR_CSP_UNSUPPORTED_KEYUSAGE_MASK */
"-2147415781" = "CSSMERR_CSP_UNSUPPORTED_KEYUSAGE_MASK";

/* CSSMERR_CSP_INVALID_KEYATTR_MASK */
"-2147415780" = "CSSMERR_CSP_INVALID_KEYATTR_MASK";

/* CSSMERR_CSP_UNSUPPORTED_KEYATTR_MASK */
"-2147415779" = "CSSMERR_CSP_UNSUPPORTED_KEYATTR_MASK";

/* CSSMERR_CSP_INVALID_KEY_LABEL */
"-2147415778" = "CSSMERR_CSP_INVALID_KEY_LABEL";

/* CSSMERR_CSP_UNSUPPORTED_KEY_LABEL */
"-2147415777" = "CSSMERR_CSP_UNSUPPORTED_KEY_LABEL";

/* CSSMERR_CSP_INVALID_KEY_FORMAT */
"-2147415776" = "CSSMERR_CSP_INVALID_KEY_FORMAT";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "CSP Vector of Buffers Error Values.";

/* CSSMERR_CSP_VECTOR_OF_BUFS_UNSUPPORTED */
"-2147415767" = "CSSMERR_CSP_VECTOR_OF_BUFS_UNSUPPORTED";

/* CSSMERR_CSP_INVALID_INPUT_VECTOR */
"-2147415766" = "CSSMERR_CSP_INVALID_INPUT_VECTOR";

/* CSSMERR_CSP_INVALID_OUTPUT_VECTOR */
"-2147415765" = "CSSMERR_CSP_INVALID_OUTPUT_VECTOR";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "CSP Cryptographic Context Error Values.";

/* CSSMERR_CSP_INVALID_ALGORITHM */
"-2147415759" = "CSSMERR_CSP_INVALID_ALGORITHM";

/* CSSMERR_CSP_INVALID_ATTR_KEY */
"-2147415754" = "CSSMERR_CSP_INVALID_ATTR_KEY";

/* CSSMERR_CSP_MISSING_ATTR_KEY */
"-2147415753" = "CSSMERR_CSP_MISSING_ATTR_KEY";

/* CSSMERR_CSP_INVALID_ATTR_INIT_VECTOR */
"-2147415752" = "CSSMERR_CSP_INVALID_ATTR_INIT_VECTOR";

/* CSSMERR_CSP_MISSING_ATTR_INIT_VECTOR */
"-2147415751" = "CSSMERR_CSP_MISSING_ATTR_INIT_VECTOR";

/* CSSMERR_CSP_INVALID_ATTR_SALT */
"-2147415750" = "CSSMERR_CSP_INVALID_ATTR_SALT";

/* CSSMERR_CSP_MISSING_ATTR_SALT */
"-2147415749" = "CSSMERR_CSP_MISSING_ATTR_SALT";

/* CSSMERR_CSP_INVALID_ATTR_PADDING */
"-2147415748" = "CSSMERR_CSP_INVALID_ATTR_PADDING";

/* CSSMERR_CSP_MISSING_ATTR_PADDING */
"-2147415747" = "CSSMERR_CSP_MISSING_ATTR_PADDING";

/* CSSMERR_CSP_INVALID_ATTR_RANDOM */
"-2147415746" = "CSSMERR_CSP_INVALID_ATTR_RANDOM";

/* CSSMERR_CSP_MISSING_ATTR_RANDOM */
"-2147415745" = "CSSMERR_CSP_MISSING_ATTR_RANDOM";

/* CSSMERR_CSP_INVALID_ATTR_SEED */
"-2147415744" = "CSSMERR_CSP_INVALID_ATTR_SEED";

/* CSSMERR_CSP_MISSING_ATTR_SEED */
"-2147415743" = "CSSMERR_CSP_MISSING_ATTR_SEED";

/* CSSMERR_CSP_INVALID_ATTR_PASSPHRASE */
"-2147415742" = "CSSMERR_CSP_INVALID_ATTR_PASSPHRASE";

/* CSSMERR_CSP_MISSING_ATTR_PASSPHRASE */
"-2147415741" = "CSSMERR_CSP_MISSING_ATTR_PASSPHRASE";

/* CSSMERR_CSP_INVALID_ATTR_KEY_LENGTH */
"-2147415740" = "CSSMERR_CSP_INVALID_ATTR_KEY_LENGTH";

/* CSSMERR_CSP_MISSING_ATTR_KEY_LENGTH */
"-2147415739" = "CSSMERR_CSP_MISSING_ATTR_KEY_LENGTH";

/* CSSMERR_CSP_INVALID_ATTR_BLOCK_SIZE */
"-2147415738" = "CSSMERR_CSP_INVALID_ATTR_BLOCK_SIZE";

/* CSSMERR_CSP_MISSING_ATTR_BLOCK_SIZE */
"-2147415737" = "CSSMERR_CSP_MISSING_ATTR_BLOCK_SIZE";

/* CSSMERR_CSP_INVALID_ATTR_OUTPUT_SIZE */
"-2147415708" = "CSSMERR_CSP_INVALID_ATTR_OUTPUT_SIZE";

/* CSSMERR_CSP_MISSING_ATTR_OUTPUT_SIZE */
"-2147415707" = "CSSMERR_CSP_MISSING_ATTR_OUTPUT_SIZE";

/* CSSMERR_CSP_INVALID_ATTR_ROUNDS */
"-2147415706" = "CSSMERR_CSP_INVALID_ATTR_ROUNDS";

/* CSSMERR_CSP_MISSING_ATTR_ROUNDS */
"-2147415705" = "CSSMERR_CSP_MISSING_ATTR_ROUNDS";

/* CSSMERR_CSP_INVALID_ATTR_ALG_PARAMS */
"-2147415704" = "CSSMERR_CSP_INVALID_ATTR_ALG_PARAMS";

/* CSSMERR_CSP_MISSING_ATTR_ALG_PARAMS */
"-2147415703" = "CSSMERR_CSP_MISSING_ATTR_ALG_PARAMS";

/* CSSMERR_CSP_INVALID_ATTR_LABEL */
"-2147415702" = "CSSMERR_CSP_INVALID_ATTR_LABEL";

/* CSSMERR_CSP_MISSING_ATTR_LABEL */
"-2147415701" = "CSSMERR_CSP_MISSING_ATTR_LABEL";

/* CSSMERR_CSP_INVALID_ATTR_KEY_TYPE */
"-2147415700" = "CSSMERR_CSP_INVALID_ATTR_KEY_TYPE";

/* CSSMERR_CSP_MISSING_ATTR_KEY_TYPE */
"-2147415699" = "CSSMERR_CSP_MISSING_ATTR_KEY_TYPE";

/* CSSMERR_CSP_INVALID_ATTR_MODE */
"-2147415698" = "CSSMERR_CSP_INVALID_ATTR_MODE";

/* CSSMERR_CSP_MISSING_ATTR_MODE */
"-2147415697" = "CSSMERR_CSP_MISSING_ATTR_MODE";

/* CSSMERR_CSP_INVALID_ATTR_EFFECTIVE_BITS */
"-2147415696" = "CSSMERR_CSP_INVALID_ATTR_EFFECTIVE_BITS";

/* CSSMERR_CSP_MISSING_ATTR_EFFECTIVE_BITS */
"-2147415695" = "CSSMERR_CSP_MISSING_ATTR_EFFECTIVE_BITS";

/* CSSMERR_CSP_INVALID_ATTR_START_DATE */
"-2147415694" = "CSSMERR_CSP_INVALID_ATTR_START_DATE";

/* CSSMERR_CSP_MISSING_ATTR_START_DATE */
"-2147415693" = "CSSMERR_CSP_MISSING_ATTR_START_DATE";

/* CSSMERR_CSP_INVALID_ATTR_END_DATE */
"-2147415692" = "CSSMERR_CSP_INVALID_ATTR_END_DATE";

/* CSSMERR_CSP_MISSING_ATTR_END_DATE */
"-2147415691" = "CSSMERR_CSP_MISSING_ATTR_END_DATE";

/* CSSMERR_CSP_INVALID_ATTR_VERSION */
"-2147415690" = "CSSMERR_CSP_INVALID_ATTR_VERSION";

/* CSSMERR_CSP_MISSING_ATTR_VERSION */
"-2147415689" = "CSSMERR_CSP_MISSING_ATTR_VERSION";

/* CSSMERR_CSP_INVALID_ATTR_PRIME */
"-2147415688" = "CSSMERR_CSP_INVALID_ATTR_PRIME";

/* CSSMERR_CSP_MISSING_ATTR_PRIME */
"-2147415687" = "CSSMERR_CSP_MISSING_ATTR_PRIME";

/* CSSMERR_CSP_INVALID_ATTR_BASE */
"-2147415686" = "CSSMERR_CSP_INVALID_ATTR_BASE";

/* CSSMERR_CSP_MISSING_ATTR_BASE */
"-2147415685" = "CSSMERR_CSP_MISSING_ATTR_BASE";

/* CSSMERR_CSP_INVALID_ATTR_SUBPRIME */
"-2147415684" = "CSSMERR_CSP_INVALID_ATTR_SUBPRIME";

/* CSSMERR_CSP_MISSING_ATTR_SUBPRIME */
"-2147415683" = "CSSMERR_CSP_MISSING_ATTR_SUBPRIME";

/* CSSMERR_CSP_INVALID_ATTR_ITERATION_COUNT */
"-2147415682" = "CSSMERR_CSP_INVALID_ATTR_ITERATION_COUNT";

/* CSSMERR_CSP_MISSING_ATTR_ITERATION_COUNT */
"-2147415681" = "CSSMERR_CSP_MISSING_ATTR_ITERATION_COUNT";

/* CSSMERR_CSP_INVALID_ATTR_DL_DB_HANDLE */
"-2147415680" = "CSSMERR_CSP_INVALID_ATTR_DL_DB_HANDLE";

/* CSSMERR_CSP_MISSING_ATTR_DL_DB_HANDLE */
"-2147415679" = "CSSMERR_CSP_MISSING_ATTR_DL_DB_HANDLE";

/* CSSMERR_CSP_INVALID_ATTR_ACCESS_CREDENTIALS */
"-2147415678" = "CSSMERR_CSP_INVALID_ATTR_ACCESS_CREDENTIALS";

/* CSSMERR_CSP_MISSING_ATTR_ACCESS_CREDENTIALS */
"-2147415677" = "CSSMERR_CSP_MISSING_ATTR_ACCESS_CREDENTIALS";

/* CSSMERR_CSP_INVALID_ATTR_PUBLIC_KEY_FORMAT */
"-2147415676" = "CSSMERR_CSP_INVALID_ATTR_PUBLIC_KEY_FORMAT";

/* CSSMERR_CSP_MISSING_ATTR_PUBLIC_KEY_FORMAT */
"-2147415675" = "CSSMERR_CSP_MISSING_ATTR_PUBLIC_KEY_FORMAT";

/* CSSMERR_CSP_INVALID_ATTR_PRIVATE_KEY_FORMAT */
"-2147415674" = "CSSMERR_CSP_INVALID_ATTR_PRIVATE_KEY_FORMAT";

/* CSSMERR_CSP_MISSING_ATTR_PRIVATE_KEY_FORMAT */
"-2147415673" = "CSSMERR_CSP_MISSING_ATTR_PRIVATE_KEY_FORMAT";

/* CSSMERR_CSP_INVALID_ATTR_SYMMETRIC_KEY_FORMAT */
"-2147415672" = "CSSMERR_CSP_INVALID_ATTR_SYMMETRIC_KEY_FORMAT";

/* CSSMERR_CSP_MISSING_ATTR_SYMMETRIC_KEY_FORMAT */
"-2147415671" = "CSSMERR_CSP_MISSING_ATTR_SYMMETRIC_KEY_FORMAT";

/* CSSMERR_CSP_INVALID_ATTR_WRAPPED_KEY_FORMAT */
"-2147415670" = "CSSMERR_CSP_INVALID_ATTR_WRAPPED_KEY_FORMAT";

/* CSSMERR_CSP_MISSING_ATTR_WRAPPED_KEY_FORMAT */
"-2147415669" = "CSSMERR_CSP_MISSING_ATTR_WRAPPED_KEY_FORMAT";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "CSP Staged Cryptographic API Error Values.";

/* CSSMERR_CSP_STAGED_OPERATION_NOT_STARTED */
"-2147415735" = "CSSMERR_CSP_STAGED_OPERATION_NOT_STARTED";

/* CSSMERR_CSP_VERIFY_FAILED */
"-2147415734" = "CSSMERR_CSP_VERIFY_FAILED";

/* CSSMERR_CSP_INVALID_SIGNATURE */
"-2147415733" = "CSSMERR_CSP_INVALID_SIGNATURE";

/* CSSMERR_CSP_QUERY_SIZE_UNKNOWN */
"-2147415732" = "CSSMERR_CSP_QUERY_SIZE_UNKNOWN";

/* CSSMERR_CSP_BLOCK_SIZE_MISMATCH */
"-2147415731" = "CSSMERR_CSP_BLOCK_SIZE_MISMATCH";

/* CSSMERR_CSP_PRIVATE_KEY_NOT_FOUND */
"-2147415730" = "CSSMERR_CSP_PRIVATE_KEY_NOT_FOUND";

/* CSSMERR_CSP_PUBLIC_KEY_INCONSISTENT */
"-2147415729" = "CSSMERR_CSP_PUBLIC_KEY_INCONSISTENT";

/* CSSMERR_CSP_DEVICE_VERIFY_FAILED */
"-2147415728" = "CSSMERR_CSP_DEVICE_VERIFY_FAILED";

/* CSSMERR_CSP_INVALID_LOGIN_NAME */
"-2147415727" = "CSSMERR_CSP_INVALID_LOGIN_NAME";

/* CSSMERR_CSP_ALREADY_LOGGED_IN */
"-2147415726" = "CSSMERR_CSP_ALREADY_LOGGED_IN";

/* CSSMERR_CSP_PRIVATE_KEY_ALREADY_EXISTS */
"-2147415725" = "CSSMERR_CSP_PRIVATE_KEY_ALREADY_EXISTS";

/* CSSMERR_CSP_KEY_LABEL_ALREADY_EXISTS */
"-2147415724" = "CSSMERR_CSP_KEY_LABEL_ALREADY_EXISTS";

/* CSSMERR_CSP_INVALID_DIGEST_ALGORITHM */
"-2147415723" = "CSSMERR_CSP_INVALID_DIGEST_ALGORITHM";

/* CSSMERR_CSP_CRYPTO_DATA_CALLBACK_FAILED */
"-2147415722" = "CSSMERR_CSP_CRYPTO_DATA_CALLBACK_FAILED";

/* CSSMERR_TP_INTERNAL_ERROR */
"-2147409919" = "CSSMERR_TP_INTERNAL_ERROR";

/* CSSMERR_TP_MEMORY_ERROR */
"-2147409918" = "CSSMERR_TP_MEMORY_ERROR";

/* CSSMERR_TP_MDS_ERROR */
"-2147409917" = "CSSMERR_TP_MDS_ERROR";

/* CSSMERR_TP_INVALID_POINTER */
"-2147409916" = "CSSMERR_TP_INVALID_POINTER";

/* CSSMERR_TP_INVALID_INPUT_POINTER */
"-2147409915" = "CSSMERR_TP_INVALID_INPUT_POINTER";

/* CSSMERR_TP_INVALID_OUTPUT_POINTER */
"-2147409914" = "CSSMERR_TP_INVALID_OUTPUT_POINTER";

/* CSSMERR_TP_FUNCTION_NOT_IMPLEMENTED */
"-2147409913" = "CSSMERR_TP_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_TP_SELF_CHECK_FAILED */
"-2147409912" = "CSSMERR_TP_SELF_CHECK_FAILED";

/* CSSMERR_TP_OS_ACCESS_DENIED */
"-2147409911" = "CSSMERR_TP_OS_ACCESS_DENIED";

/* CSSMERR_TP_FUNCTION_FAILED */
"-2147409910" = "CSSMERR_TP_FUNCTION_FAILED";

/* CSSMERR_TP_INVALID_CONTEXT_HANDLE */
"-2147409856" = "CSSMERR_TP_INVALID_CONTEXT_HANDLE";

/* CSSMERR_TP_INVALID_DATA */
"-2147409850" = "CSSMERR_TP_INVALID_DATA";

/* CSSMERR_TP_INVALID_DB_LIST */
"-2147409844" = "CSSMERR_TP_INVALID_DB_LIST";

/* CSSMERR_TP_INVALID_CERTGROUP_POINTER */
"-2147409854" = "CSSMERR_TP_INVALID_CERTGROUP_POINTER";

/* CSSMERR_TP_INVALID_CERT_POINTER */
"-2147409853" = "CSSMERR_TP_INVALID_CERT_POINTER";

/* CSSMERR_TP_INVALID_CRL_POINTER */
"-2147409852" = "CSSMERR_TP_INVALID_CRL_POINTER";

/* CSSMERR_TP_INVALID_FIELD_POINTER */
"-2147409851" = "CSSMERR_TP_INVALID_FIELD_POINTER";

/* CSSMERR_TP_INVALID_NETWORK_ADDR */
"-2147409833" = "CSSMERR_TP_INVALID_NETWORK_ADDR";

/* CSSMERR_TP_CRL_ALREADY_SIGNED */
"-2147409849" = "CSSMERR_TP_CRL_ALREADY_SIGNED";

/* CSSMERR_TP_INVALID_NUMBER_OF_FIELDS */
"-2147409848" = "CSSMERR_TP_INVALID_NUMBER_OF_FIELDS";

/* CSSMERR_TP_VERIFICATION_FAILURE */
"-2147409847" = "CSSMERR_TP_VERIFICATION_FAILURE";

/* CSSMERR_TP_INVALID_DB_HANDLE */
"-2147409846" = "CSSMERR_TP_INVALID_DB_HANDLE";

/* CSSMERR_TP_UNKNOWN_FORMAT */
"-2147409842" = "CSSMERR_TP_UNKNOWN_FORMAT";

/* CSSMERR_TP_UNKNOWN_TAG */
"-2147409841" = "CSSMERR_TP_UNKNOWN_TAG";

/* CSSMERR_TP_INVALID_PASSTHROUGH_ID */
"-2147409834" = "CSSMERR_TP_INVALID_PASSTHROUGH_ID";

/* CSSMERR_TP_INVALID_CSP_HANDLE */
"-2147409840" = "CSSMERR_TP_INVALID_CSP_HANDLE";

/* CSSMERR_TP_INVALID_DL_HANDLE */
"-2147409839" = "CSSMERR_TP_INVALID_DL_HANDLE";

/* CSSMERR_TP_INVALID_CL_HANDLE */
"-2147409838" = "CSSMERR_TP_INVALID_CL_HANDLE";

/* CSSMERR_TP_INVALID_DB_LIST_POINTER */
"-2147409843" = "CSSMERR_TP_INVALID_DB_LIST_POINTER";

/* CSSMERR_TP_INVALID_CALLERAUTH_CONTEXT_POINTER */
"-2147409663" = "CSSMERR_TP_INVALID_CALLERAUTH_CONTEXT_POINTER";

/* CSSMERR_TP_INVALID_IDENTIFIER_POINTER */
"-2147409662" = "CSSMERR_TP_INVALID_IDENTIFIER_POINTER";

/* CSSMERR_TP_INVALID_KEYCACHE_HANDLE */
"-2147409661" = "CSSMERR_TP_INVALID_KEYCACHE_HANDLE";

/* CSSMERR_TP_INVALID_CERTGROUP */
"-2147409660" = "CSSMERR_TP_INVALID_CERTGROUP";

/* CSSMERR_TP_INVALID_CRLGROUP */
"-2147409659" = "CSSMERR_TP_INVALID_CRLGROUP";

/* CSSMERR_TP_INVALID_CRLGROUP_POINTER */
"-2147409658" = "CSSMERR_TP_INVALID_CRLGROUP_POINTER";

/* CSSMERR_TP_AUTHENTICATION_FAILED */
"-2147409657" = "CSSMERR_TP_AUTHENTICATION_FAILED";

/* CSSMERR_TP_CERTGROUP_INCOMPLETE */
"-2147409656" = "CSSMERR_TP_CERTGROUP_INCOMPLETE";

/* CSSMERR_TP_CERTIFICATE_CANT_OPERATE */
"-2147409655" = "CSSMERR_TP_CERTIFICATE_CANT_OPERATE";

/* CSSMERR_TP_CERT_EXPIRED */
"-2147409654" = "CSSMERR_TP_CERT_EXPIRED";

/* CSSMERR_TP_CERT_NOT_VALID_YET */
"-2147409653" = "CSSMERR_TP_CERT_NOT_VALID_YET";

/* CSSMERR_TP_CERT_REVOKED */
"-2147409652" = "CSSMERR_TP_CERT_REVOKED";

/* CSSMERR_TP_CERT_SUSPENDED */
"-2147409651" = "CSSMERR_TP_CERT_SUSPENDED";

/* CSSMERR_TP_INSUFFICIENT_CREDENTIALS */
"-2147409650" = "CSSMERR_TP_INSUFFICIENT_CREDENTIALS";

/* CSSMERR_TP_INVALID_ACTION */
"-2147409649" = "CSSMERR_TP_INVALID_ACTION";

/* CSSMERR_TP_INVALID_ACTION_DATA */
"-2147409648" = "CSSMERR_TP_INVALID_ACTION_DATA";

/* CSSMERR_TP_INVALID_ANCHOR_CERT */
"-2147409646" = "CSSMERR_TP_INVALID_ANCHOR_CERT";

/* CSSMERR_TP_INVALID_AUTHORITY */
"-2147409645" = "CSSMERR_TP_INVALID_AUTHORITY";

/* CSSMERR_TP_VERIFY_ACTION_FAILED */
"-2147409644" = "CSSMERR_TP_VERIFY_ACTION_FAILED";

/* CSSMERR_TP_INVALID_CERTIFICATE */
"-2147409643" = "CSSMERR_TP_INVALID_CERTIFICATE";

/* CSSMERR_TP_INVALID_CERT_AUTHORITY */
"-2147409642" = "CSSMERR_TP_INVALID_CERT_AUTHORITY";

/* CSSMERR_TP_INVALID_CRL_AUTHORITY */
"-2147409641" = "CSSMERR_TP_INVALID_CRL_AUTHORITY";

/* CSSMERR_TP_INVALID_CRL_ENCODING */
"-2147409640" = "CSSMERR_TP_INVALID_CRL_ENCODING";

/* CSSMERR_TP_INVALID_CRL_TYPE */
"-2147409639" = "CSSMERR_TP_INVALID_CRL_TYPE";

/* CSSMERR_TP_INVALID_CRL */
"-2147409638" = "CSSMERR_TP_INVALID_CRL";

/* CSSMERR_TP_INVALID_FORM_TYPE */
"-2147409637" = "CSSMERR_TP_INVALID_FORM_TYPE";

/* CSSMERR_TP_INVALID_ID */
"-2147409636" = "CSSMERR_TP_INVALID_ID";

/* CSSMERR_TP_INVALID_IDENTIFIER */
"-2147409635" = "CSSMERR_TP_INVALID_IDENTIFIER";

/* CSSMERR_TP_INVALID_INDEX */
"-2147409634" = "CSSMERR_TP_INVALID_INDEX";

/* CSSMERR_TP_INVALID_NAME */
"-2147409633" = "CSSMERR_TP_INVALID_NAME";

/* CSSMERR_TP_INVALID_POLICY_IDENTIFIERS */
"-2147409632" = "CSSMERR_TP_INVALID_POLICY_IDENTIFIERS";

/* CSSMERR_TP_INVALID_TIMESTRING */
"-2147409631" = "CSSMERR_TP_INVALID_TIMESTRING";

/* CSSMERR_TP_INVALID_REASON */
"-2147409630" = "CSSMERR_TP_INVALID_REASON";

/* CSSMERR_TP_INVALID_REQUEST_INPUTS */
"-2147409629" = "CSSMERR_TP_INVALID_REQUEST_INPUTS";

/* CSSMERR_TP_INVALID_RESPONSE_VECTOR */
"-2147409628" = "CSSMERR_TP_INVALID_RESPONSE_VECTOR";

/* CSSMERR_TP_INVALID_SIGNATURE */
"-2147409627" = "CSSMERR_TP_INVALID_SIGNATURE";

/* CSSMERR_TP_INVALID_STOP_ON_POLICY */
"-2147409626" = "CSSMERR_TP_INVALID_STOP_ON_POLICY";

/* CSSMERR_TP_INVALID_CALLBACK */
"-2147409625" = "CSSMERR_TP_INVALID_CALLBACK";

/* CSSMERR_TP_INVALID_TUPLE */
"-2147409624" = "CSSMERR_TP_INVALID_TUPLE";

/* CSSMERR_TP_NOT_SIGNER */
"-2147409623" = "CSSMERR_TP_NOT_SIGNER";

/* CSSMERR_TP_NOT_TRUSTED */
"-2147409622" = "CSSMERR_TP_NOT_TRUSTED";

/* CSSMERR_TP_NO_DEFAULT_AUTHORITY */
"-2147409621" = "CSSMERR_TP_NO_DEFAULT_AUTHORITY";

/* CSSMERR_TP_REJECTED_FORM */
"-2147409620" = "CSSMERR_TP_REJECTED_FORM";

/* CSSMERR_TP_REQUEST_LOST */
"-2147409619" = "CSSMERR_TP_REQUEST_LOST";

/* CSSMERR_TP_REQUEST_REJECTED */
"-2147409618" = "CSSMERR_TP_REQUEST_REJECTED";

/* CSSMERR_TP_UNSUPPORTED_ADDR_TYPE */
"-2147409617" = "CSSMERR_TP_UNSUPPORTED_ADDR_TYPE";

/* CSSMERR_TP_UNSUPPORTED_SERVICE */
"-2147409616" = "CSSMERR_TP_UNSUPPORTED_SERVICE";

/* CSSMERR_TP_INVALID_TUPLEGROUP_POINTER */
"-2147409615" = "CSSMERR_TP_INVALID_TUPLEGROUP_POINTER";

/* CSSMERR_TP_INVALID_TUPLEGROUP */
"-2147409614" = "CSSMERR_TP_INVALID_TUPLEGROUP";

/* CSSMERR_AC_INTERNAL_ERROR */
"-2147405823" = "CSSMERR_AC_INTERNAL_ERROR";

/* CSSMERR_AC_MEMORY_ERROR */
"-2147405822" = "CSSMERR_AC_MEMORY_ERROR";

/* CSSMERR_AC_MDS_ERROR */
"-2147405821" = "CSSMERR_AC_MDS_ERROR";

/* CSSMERR_AC_INVALID_POINTER */
"-2147405820" = "CSSMERR_AC_INVALID_POINTER";

/* CSSMERR_AC_INVALID_INPUT_POINTER */
"-2147405819" = "CSSMERR_AC_INVALID_INPUT_POINTER";

/* CSSMERR_AC_INVALID_OUTPUT_POINTER */
"-2147405818" = "CSSMERR_AC_INVALID_OUTPUT_POINTER";

/* CSSMERR_AC_FUNCTION_NOT_IMPLEMENTED */
"-2147405817" = "CSSMERR_AC_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_AC_SELF_CHECK_FAILED */
"-2147405816" = "CSSMERR_AC_SELF_CHECK_FAILED";

/* CSSMERR_AC_OS_ACCESS_DENIED */
"-2147405815" = "CSSMERR_AC_OS_ACCESS_DENIED";

/* CSSMERR_AC_FUNCTION_FAILED */
"-2147405814" = "CSSMERR_AC_FUNCTION_FAILED";

/* CSSMERR_AC_INVALID_CONTEXT_HANDLE */
"-2147405760" = "CSSMERR_AC_INVALID_CONTEXT_HANDLE";

/* CSSMERR_AC_INVALID_DATA */
"-2147405754" = "CSSMERR_AC_INVALID_DATA";

/* CSSMERR_AC_INVALID_DB_LIST */
"-2147405748" = "CSSMERR_AC_INVALID_DB_LIST";

/* CSSMERR_AC_INVALID_PASSTHROUGH_ID */
"-2147405738" = "CSSMERR_AC_INVALID_PASSTHROUGH_ID";

/* CSSMERR_AC_INVALID_DL_HANDLE */
"-2147405743" = "CSSMERR_AC_INVALID_DL_HANDLE";

/* CSSMERR_AC_INVALID_CL_HANDLE */
"-2147405742" = "CSSMERR_AC_INVALID_CL_HANDLE";

/* CSSMERR_AC_INVALID_TP_HANDLE */
"-2147405741" = "CSSMERR_AC_INVALID_TP_HANDLE";

/* CSSMERR_AC_INVALID_DB_HANDLE */
"-2147405750" = "CSSMERR_AC_INVALID_DB_HANDLE";

/* CSSMERR_AC_INVALID_DB_LIST_POINTER */
"-2147405747" = "CSSMERR_AC_INVALID_DB_LIST_POINTER";

/* CSSMERR_AC_INVALID_BASE_ACLS */
"-2147405567" = "CSSMERR_AC_INVALID_BASE_ACLS";

/* CSSMERR_AC_INVALID_TUPLE_CREDENTIALS */
"-2147405566" = "CSSMERR_AC_INVALID_TUPLE_CREDENTIALS";

/* CSSMERR_AC_INVALID_ENCODING */
"-2147405565" = "CSSMERR_AC_INVALID_ENCODING";

/* CSSMERR_AC_INVALID_VALIDITY_PERIOD */
"-2147405564" = "CSSMERR_AC_INVALID_VALIDITY_PERIOD";

/* CSSMERR_AC_INVALID_REQUESTOR */
"-2147405563" = "CSSMERR_AC_INVALID_REQUESTOR";

/* CSSMERR_AC_INVALID_REQUEST_DESCRIPTOR */
"-2147405562" = "CSSMERR_AC_INVALID_REQUEST_DESCRIPTOR";

/* CSSMERR_CL_INTERNAL_ERROR */
"-2147411967" = "CSSMERR_CL_INTERNAL_ERROR";

/* CSSMERR_CL_MEMORY_ERROR */
"-2147411966" = "CSSMERR_CL_MEMORY_ERROR";

/* CSSMERR_CL_MDS_ERROR */
"-2147411965" = "CSSMERR_CL_MDS_ERROR";

/* CSSMERR_CL_INVALID_POINTER */
"-2147411964" = "CSSMERR_CL_INVALID_POINTER";

/* CSSMERR_CL_INVALID_INPUT_POINTER */
"-2147411963" = "CSSMERR_CL_INVALID_INPUT_POINTER";

/* CSSMERR_CL_INVALID_OUTPUT_POINTER */
"-2147411962" = "CSSMERR_CL_INVALID_OUTPUT_POINTER";

/* CSSMERR_CL_FUNCTION_NOT_IMPLEMENTED */
"-2147411961" = "CSSMERR_CL_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_CL_SELF_CHECK_FAILED */
"-2147411960" = "CSSMERR_CL_SELF_CHECK_FAILED";

/* CSSMERR_CL_OS_ACCESS_DENIED */
"-2147411959" = "CSSMERR_CL_OS_ACCESS_DENIED";

/* CSSMERR_CL_FUNCTION_FAILED */
"-2147411958" = "CSSMERR_CL_FUNCTION_FAILED";

/* CSSMERR_CL_INVALID_CONTEXT_HANDLE */
"-2147411904" = "CSSMERR_CL_INVALID_CONTEXT_HANDLE";

/* CSSMERR_CL_INVALID_CERTGROUP_POINTER */
"-2147411902" = "CSSMERR_CL_INVALID_CERTGROUP_POINTER";

/* CSSMERR_CL_INVALID_CERT_POINTER */
"-2147411901" = "CSSMERR_CL_INVALID_CERT_POINTER";

/* CSSMERR_CL_INVALID_CRL_POINTER */
"-2147411900" = "CSSMERR_CL_INVALID_CRL_POINTER";

/* CSSMERR_CL_INVALID_FIELD_POINTER */
"-2147411899" = "CSSMERR_CL_INVALID_FIELD_POINTER";

/* CSSMERR_CL_INVALID_DATA */
"-2147411898" = "CSSMERR_CL_INVALID_DATA";

/* CSSMERR_CL_CRL_ALREADY_SIGNED */
"-2147411897" = "CSSMERR_CL_CRL_ALREADY_SIGNED";

/* CSSMERR_CL_INVALID_NUMBER_OF_FIELDS */
"-2147411896" = "CSSMERR_CL_INVALID_NUMBER_OF_FIELDS";

/* CSSMERR_CL_VERIFICATION_FAILURE */
"-2147411895" = "CSSMERR_CL_VERIFICATION_FAILURE";

/* CSSMERR_CL_UNKNOWN_FORMAT */
"-2147411890" = "CSSMERR_CL_UNKNOWN_FORMAT";

/* CSSMERR_CL_UNKNOWN_TAG */
"-2147411889" = "CSSMERR_CL_UNKNOWN_TAG";

/* CSSMERR_CL_INVALID_PASSTHROUGH_ID */
"-2147411882" = "CSSMERR_CL_INVALID_PASSTHROUGH_ID";

/* CSSMERR_CL_INVALID_BUNDLE_POINTER */
"-2147411711" = "CSSMERR_CL_INVALID_BUNDLE_POINTER";

/* CSSMERR_CL_INVALID_CACHE_HANDLE */
"-2147411710" = "CSSMERR_CL_INVALID_CACHE_HANDLE";

/* CSSMERR_CL_INVALID_RESULTS_HANDLE */
"-2147411709" = "CSSMERR_CL_INVALID_RESULTS_HANDLE";

/* CSSMERR_CL_INVALID_BUNDLE_INFO */
"-2147411708" = "CSSMERR_CL_INVALID_BUNDLE_INFO";

/* CSSMERR_CL_INVALID_CRL_INDEX */
"-2147411707" = "CSSMERR_CL_INVALID_CRL_INDEX";

/* CSSMERR_CL_INVALID_SCOPE */
"-2147411706" = "CSSMERR_CL_INVALID_SCOPE";

/* CSSMERR_CL_NO_FIELD_VALUES */
"-2147411705" = "CSSMERR_CL_NO_FIELD_VALUES";

/* CSSMERR_CL_SCOPE_NOT_SUPPORTED */
"-2147411704" = "CSSMERR_CL_SCOPE_NOT_SUPPORTED";

/* CSSMERR_DL_INTERNAL_ERROR */
"-2147414015" = "CSSMERR_DL_INTERNAL_ERROR";

/* CSSMERR_DL_MEMORY_ERROR */
"-2147414014" = "CSSMERR_DL_MEMORY_ERROR";

/* CSSMERR_DL_MDS_ERROR */
"-2147414013" = "CSSMERR_DL_MDS_ERROR";

/* CSSMERR_DL_INVALID_POINTER */
"-2147414012" = "CSSMERR_DL_INVALID_POINTER";

/* CSSMERR_DL_INVALID_INPUT_POINTER */
"-2147414011" = "CSSMERR_DL_INVALID_INPUT_POINTER";

/* CSSMERR_DL_INVALID_OUTPUT_POINTER */
"-2147414010" = "CSSMERR_DL_INVALID_OUTPUT_POINTER";

/* CSSMERR_DL_FUNCTION_NOT_IMPLEMENTED */
"-2147414009" = "CSSMERR_DL_FUNCTION_NOT_IMPLEMENTED";

/* CSSMERR_DL_SELF_CHECK_FAILED */
"-2147414008" = "CSSMERR_DL_SELF_CHECK_FAILED";

/* CSSMERR_DL_OS_ACCESS_DENIED */
"-2147414007" = "CSSMERR_DL_OS_ACCESS_DENIED";

/* CSSMERR_DL_FUNCTION_FAILED */
"-2147414006" = "CSSMERR_DL_FUNCTION_FAILED";

/* CSSMERR_DL_INVALID_CSP_HANDLE */
"-2147413936" = "CSSMERR_DL_INVALID_CSP_HANDLE";

/* CSSMERR_DL_INVALID_DL_HANDLE */
"-2147413935" = "CSSMERR_DL_INVALID_DL_HANDLE";

/* CSSMERR_DL_INVALID_CL_HANDLE */
"-2147413934" = "CSSMERR_DL_INVALID_CL_HANDLE";

/* CSSMERR_DL_INVALID_DB_LIST_POINTER */
"-2147413939" = "CSSMERR_DL_INVALID_DB_LIST_POINTER";

/* CSSMERR_DL_OPERATION_AUTH_DENIED */
"-2147413984" = "CSSMERR_DL_OPERATION_AUTH_DENIED";

/* CSSMERR_DL_OBJECT_USE_AUTH_DENIED */
"-2147413983" = "CSSMERR_DL_OBJECT_USE_AUTH_DENIED";

/* CSSMERR_DL_OBJECT_MANIP_AUTH_DENIED */
"-2147413982" = "CSSMERR_DL_OBJECT_MANIP_AUTH_DENIED";

/* CSSMERR_DL_OBJECT_ACL_NOT_SUPPORTED */
"-2147413981" = "CSSMERR_DL_OBJECT_ACL_NOT_SUPPORTED";

/* CSSMERR_DL_OBJECT_ACL_REQUIRED */
"-2147413980" = "CSSMERR_DL_OBJECT_ACL_REQUIRED";

/* CSSMERR_DL_INVALID_ACCESS_CREDENTIALS */
"-2147413979" = "CSSMERR_DL_INVALID_ACCESS_CREDENTIALS";

/* CSSMERR_DL_INVALID_ACL_BASE_CERTS */
"-2147413978" = "CSSMERR_DL_INVALID_ACL_BASE_CERTS";

/* CSSMERR_DL_ACL_BASE_CERTS_NOT_SUPPORTED */
"-2147413977" = "CSSMERR_DL_ACL_BASE_CERTS_NOT_SUPPORTED";

/* CSSMERR_DL_INVALID_SAMPLE_VALUE */
"-2147413976" = "CSSMERR_DL_INVALID_SAMPLE_VALUE";

/* CSSMERR_DL_SAMPLE_VALUE_NOT_SUPPORTED */
"-2147413975" = "CSSMERR_DL_SAMPLE_VALUE_NOT_SUPPORTED";

/* CSSMERR_DL_INVALID_ACL_SUBJECT_VALUE */
"-2147413974" = "CSSMERR_DL_INVALID_ACL_SUBJECT_VALUE";

/* CSSMERR_DL_ACL_SUBJECT_TYPE_NOT_SUPPORTED */
"-2147413973" = "CSSMERR_DL_ACL_SUBJECT_TYPE_NOT_SUPPORTED";

/* CSSMERR_DL_INVALID_ACL_CHALLENGE_CALLBACK */
"-2147413972" = "CSSMERR_DL_INVALID_ACL_CHALLENGE_CALLBACK";

/* CSSMERR_DL_ACL_CHALLENGE_CALLBACK_FAILED */
"-2147413971" = "CSSMERR_DL_ACL_CHALLENGE_CALLBACK_FAILED";

/* CSSMERR_DL_INVALID_ACL_ENTRY_TAG */
"-2147413970" = "CSSMERR_DL_INVALID_ACL_ENTRY_TAG";

/* CSSMERR_DL_ACL_ENTRY_TAG_NOT_FOUND */
"-2147413969" = "CSSMERR_DL_ACL_ENTRY_TAG_NOT_FOUND";

/* CSSMERR_DL_INVALID_ACL_EDIT_MODE */
"-2147413968" = "CSSMERR_DL_INVALID_ACL_EDIT_MODE";

/* CSSMERR_DL_ACL_CHANGE_FAILED */
"-2147413967" = "CSSMERR_DL_ACL_CHANGE_FAILED";

/* CSSMERR_DL_INVALID_NEW_ACL_ENTRY */
"-2147413966" = "CSSMERR_DL_INVALID_NEW_ACL_ENTRY";

/* CSSMERR_DL_INVALID_NEW_ACL_OWNER */
"-2147413965" = "CSSMERR_DL_INVALID_NEW_ACL_OWNER";

/* CSSMERR_DL_ACL_DELETE_FAILED */
"-2147413964" = "CSSMERR_DL_ACL_DELETE_FAILED";

/* CSSMERR_DL_ACL_REPLACE_FAILED */
"-2147413963" = "CSSMERR_DL_ACL_REPLACE_FAILED";

/* CSSMERR_DL_ACL_ADD_FAILED */
"-2147413962" = "CSSMERR_DL_ACL_ADD_FAILED";

/* CSSMERR_DL_INVALID_DB_HANDLE */
"-2147413942" = "CSSMERR_DL_INVALID_DB_HANDLE";

/* CSSMERR_DL_INVALID_PASSTHROUGH_ID */
"-2147413930" = "CSSMERR_DL_INVALID_PASSTHROUGH_ID";

/* CSSMERR_DL_INVALID_NETWORK_ADDR */
"-2147413929" = "CSSMERR_DL_INVALID_NETWORK_ADDR";

/* CSSMERR_DL_DATABASE_CORRUPT */
"-2147413759" = "CSSMERR_DL_DATABASE_CORRUPT";

/* CSSMERR_DL_INVALID_RECORD_INDEX */
"-2147413752" = "CSSMERR_DL_INVALID_RECORD_INDEX";

/* CSSMERR_DL_INVALID_RECORDTYPE */
"-2147413751" = "CSSMERR_DL_INVALID_RECORDTYPE";

/* CSSMERR_DL_INVALID_FIELD_NAME */
"-2147413750" = "CSSMERR_DL_INVALID_FIELD_NAME";

/* CSSMERR_DL_UNSUPPORTED_FIELD_FORMAT */
"-2147413749" = "CSSMERR_DL_UNSUPPORTED_FIELD_FORMAT";

/* CSSMERR_DL_UNSUPPORTED_INDEX_INFO */
"-2147413748" = "CSSMERR_DL_UNSUPPORTED_INDEX_INFO";

/* CSSMERR_DL_UNSUPPORTED_LOCALITY */
"-2147413747" = "CSSMERR_DL_UNSUPPORTED_LOCALITY";

/* CSSMERR_DL_UNSUPPORTED_NUM_ATTRIBUTES */
"-2147413746" = "CSSMERR_DL_UNSUPPORTED_NUM_ATTRIBUTES";

/* CSSMERR_DL_UNSUPPORTED_NUM_INDEXES */
"-2147413745" = "CSSMERR_DL_UNSUPPORTED_NUM_INDEXES";

/* CSSMERR_DL_UNSUPPORTED_NUM_RECORDTYPES */
"-2147413744" = "CSSMERR_DL_UNSUPPORTED_NUM_RECORDTYPES";

/* CSSMERR_DL_UNSUPPORTED_RECORDTYPE */
"-2147413743" = "CSSMERR_DL_UNSUPPORTED_RECORDTYPE";

/* CSSMERR_DL_FIELD_SPECIFIED_MULTIPLE */
"-2147413742" = "CSSMERR_DL_FIELD_SPECIFIED_MULTIPLE";

/* CSSMERR_DL_INCOMPATIBLE_FIELD_FORMAT */
"-2147413741" = "CSSMERR_DL_INCOMPATIBLE_FIELD_FORMAT";

/* CSSMERR_DL_INVALID_PARSING_MODULE */
"-2147413740" = "CSSMERR_DL_INVALID_PARSING_MODULE";

/* CSSMERR_DL_INVALID_DB_NAME */
"-2147413738" = "CSSMERR_DL_INVALID_DB_NAME";

/* CSSMERR_DL_DATASTORE_DOESNOT_EXIST */
"-2147413737" = "CSSMERR_DL_DATASTORE_DOESNOT_EXIST";

/* CSSMERR_DL_DATASTORE_ALREADY_EXISTS */
"-2147413736" = "CSSMERR_DL_DATASTORE_ALREADY_EXISTS";

/* CSSMERR_DL_DB_LOCKED */
"-2147413735" = "CSSMERR_DL_DB_LOCKED";

/* CSSMERR_DL_DATASTORE_IS_OPEN */
"-2147413734" = "CSSMERR_DL_DATASTORE_IS_OPEN";

/* CSSMERR_DL_RECORD_NOT_FOUND */
"-2147413733" = "CSSMERR_DL_RECORD_NOT_FOUND";

/* CSSMERR_DL_MISSING_VALUE */
"-2147413732" = "CSSMERR_DL_MISSING_VALUE";

/* CSSMERR_DL_UNSUPPORTED_QUERY */
"-2147413731" = "CSSMERR_DL_UNSUPPORTED_QUERY";

/* CSSMERR_DL_UNSUPPORTED_QUERY_LIMITS */
"-2147413730" = "CSSMERR_DL_UNSUPPORTED_QUERY_LIMITS";

/* CSSMERR_DL_UNSUPPORTED_NUM_SELECTION_PREDS */
"-2147413729" = "CSSMERR_DL_UNSUPPORTED_NUM_SELECTION_PREDS";

/* CSSMERR_DL_UNSUPPORTED_OPERATOR */
"-2147413727" = "CSSMERR_DL_UNSUPPORTED_OPERATOR";

/* CSSMERR_DL_INVALID_RESULTS_HANDLE */
"-2147413726" = "CSSMERR_DL_INVALID_RESULTS_HANDLE";

/* CSSMERR_DL_INVALID_DB_LOCATION */
"-2147413725" = "CSSMERR_DL_INVALID_DB_LOCATION";

/* CSSMERR_DL_INVALID_ACCESS_REQUEST */
"-2147413724" = "CSSMERR_DL_INVALID_ACCESS_REQUEST";

/* CSSMERR_DL_INVALID_INDEX_INFO */
"-2147413723" = "CSSMERR_DL_INVALID_INDEX_INFO";

/* CSSMERR_DL_INVALID_SELECTION_TAG */
"-2147413722" = "CSSMERR_DL_INVALID_SELECTION_TAG";

/* CSSMERR_DL_INVALID_NEW_OWNER */
"-2147413721" = "CSSMERR_DL_INVALID_NEW_OWNER";

/* CSSMERR_DL_INVALID_RECORD_UID */
"-2147413720" = "CSSMERR_DL_INVALID_RECORD_UID";

/* CSSMERR_DL_INVALID_UNIQUE_INDEX_DATA */
"-2147413719" = "CSSMERR_DL_INVALID_UNIQUE_INDEX_DATA";

/* CSSMERR_DL_INVALID_MODIFY_MODE */
"-2147413718" = "CSSMERR_DL_INVALID_MODIFY_MODE";

/* CSSMERR_DL_INVALID_OPEN_PARAMETERS */
"-2147413717" = "CSSMERR_DL_INVALID_OPEN_PARAMETERS";

/* CSSMERR_DL_RECORD_MODIFIED */
"-2147413716" = "CSSMERR_DL_RECORD_MODIFIED";

/* CSSMERR_DL_ENDOFDATA */
"-2147413715" = "CSSMERR_DL_ENDOFDATA";

/* CSSMERR_DL_INVALID_QUERY */
"-2147413714" = "CSSMERR_DL_INVALID_QUERY";

/* CSSMERR_DL_INVALID_VALUE */
"-2147413713" = "CSSMERR_DL_INVALID_VALUE";

/* CSSMERR_DL_MULTIPLE_VALUES_UNSUPPORTED */
"-2147413712" = "CSSMERR_DL_MULTIPLE_VALUES_UNSUPPORTED";

/* CSSMERR_DL_STALE_UNIQUE_RECORD */
"-2147413711" = "CSSMERR_DL_STALE_UNIQUE_RECORD";

/* CSSM_ERRCODE_NO_USER_INTERACTION */
"224" = "CSSM_ERRCODE_NO_USER_INTERACTION";

/* CSSM_ERRCODE_USER_CANCELED */
"225" = "CSSM_ERRCODE_USER_CANCELED";

/* CSSM_ERRCODE_SERVICE_NOT_AVAILABLE */
"226" = "CSSM_ERRCODE_SERVICE_NOT_AVAILABLE";

/* CSSM_ERRCODE_INSUFFICIENT_CLIENT_IDENTIFICATION */
"227" = "CSSM_ERRCODE_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSM_ERRCODE_DEVICE_RESET */
"228" = "CSSM_ERRCODE_DEVICE_RESET";

/* CSSM_ERRCODE_DEVICE_FAILED */
"229" = "CSSM_ERRCODE_DEVICE_FAILED";

/* CSSMERR_CSSM_NO_USER_INTERACTION */
"-2147417888" = "CSSMERR_CSSM_NO_USER_INTERACTION";

/* CSSMERR_AC_NO_USER_INTERACTION */
"-2147405600" = "CSSMERR_AC_NO_USER_INTERACTION";

/* CSSMERR_CSP_NO_USER_INTERACTION */
"-2147415840" = "CSSMERR_CSP_NO_USER_INTERACTION";

/* CSSMERR_CL_NO_USER_INTERACTION */
"-2147411744" = "CSSMERR_CL_NO_USER_INTERACTION";

/* CSSMERR_DL_NO_USER_INTERACTION */
"-2147413792" = "CSSMERR_DL_NO_USER_INTERACTION";

/* CSSMERR_TP_NO_USER_INTERACTION */
"-2147409696" = "CSSMERR_TP_NO_USER_INTERACTION";

/* CSSMERR_CSSM_USER_CANCELED */
"-2147417887" = "CSSMERR_CSSM_USER_CANCELED";

/* CSSMERR_AC_USER_CANCELED */
"-2147405599" = "CSSMERR_AC_USER_CANCELED";

/* CSSMERR_CSP_USER_CANCELED */
"-2147415839" = "CSSMERR_CSP_USER_CANCELED";

/* CSSMERR_CL_USER_CANCELED */
"-2147411743" = "CSSMERR_CL_USER_CANCELED";

/* CSSMERR_DL_USER_CANCELED */
"-2147413791" = "CSSMERR_DL_USER_CANCELED";

/* CSSMERR_TP_USER_CANCELED */
"-2147409695" = "CSSMERR_TP_USER_CANCELED";

/* CSSMERR_CSSM_SERVICE_NOT_AVAILABLE */
"-2147417886" = "CSSMERR_CSSM_SERVICE_NOT_AVAILABLE";

/* CSSMERR_AC_SERVICE_NOT_AVAILABLE */
"-2147405598" = "CSSMERR_AC_SERVICE_NOT_AVAILABLE";

/* CSSMERR_CSP_SERVICE_NOT_AVAILABLE */
"-2147415838" = "CSSMERR_CSP_SERVICE_NOT_AVAILABLE";

/* CSSMERR_CL_SERVICE_NOT_AVAILABLE */
"-2147411742" = "CSSMERR_CL_SERVICE_NOT_AVAILABLE";

/* CSSMERR_DL_SERVICE_NOT_AVAILABLE */
"-2147413790" = "CSSMERR_DL_SERVICE_NOT_AVAILABLE";

/* CSSMERR_TP_SERVICE_NOT_AVAILABLE */
"-2147409694" = "CSSMERR_TP_SERVICE_NOT_AVAILABLE";

/* CSSMERR_CSSM_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147417885" = "CSSMERR_CSSM_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_AC_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147405597" = "CSSMERR_AC_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_CSP_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147415837" = "CSSMERR_CSP_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_CL_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147411741" = "CSSMERR_CL_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_DL_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147413789" = "CSSMERR_DL_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_TP_INSUFFICIENT_CLIENT_IDENTIFICATION */
"-2147409693" = "CSSMERR_TP_INSUFFICIENT_CLIENT_IDENTIFICATION";

/* CSSMERR_CSSM_DEVICE_RESET */
"-2147417884" = "CSSMERR_CSSM_DEVICE_RESET";

/* CSSMERR_AC_DEVICE_RESET */
"-2147405596" = "CSSMERR_AC_DEVICE_RESET";

/* CSSMERR_CSP_DEVICE_RESET */
"-2147415836" = "CSSMERR_CSP_DEVICE_RESET";

/* CSSMERR_CL_DEVICE_RESET */
"-2147411740" = "CSSMERR_CL_DEVICE_RESET";

/* CSSMERR_DL_DEVICE_RESET */
"-2147413788" = "CSSMERR_DL_DEVICE_RESET";

/* CSSMERR_TP_DEVICE_RESET */
"-2147409692" = "CSSMERR_TP_DEVICE_RESET";

/* CSSMERR_CSSM_DEVICE_FAILED */
"-2147417883" = "CSSMERR_CSSM_DEVICE_FAILED";

/* CSSMERR_AC_DEVICE_FAILED */
"-2147405595" = "CSSMERR_AC_DEVICE_FAILED";

/* CSSMERR_CSP_DEVICE_FAILED */
"-2147415835" = "CSSMERR_CSP_DEVICE_FAILED";

/* CSSMERR_CL_DEVICE_FAILED */
"-2147411739" = "CSSMERR_CL_DEVICE_FAILED";

/* CSSMERR_DL_DEVICE_FAILED */
"-2147413787" = "CSSMERR_DL_DEVICE_FAILED";

/* CSSMERR_TP_DEVICE_FAILED */
"-2147409691" = "CSSMERR_TP_DEVICE_FAILED";

/* CSSMERR_CSP_APPLE_ADD_APPLICATION_ACL_SUBJECT */
"-2147415040" = "CSSMERR_CSP_APPLE_ADD_APPLICATION_ACL_SUBJECT";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* An attempt was made to use a public key which is incomplete due to * the lack of algorithm-specific parameters.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "a code signature match failed";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Key StartDate/EndDate invalid";

/* CSSMERR_CSP_APPLE_INVALID_KEY_END_DATE */
"-2147415036" = "CSSMERR_CSP_APPLE_INVALID_KEY_END_DATE";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Keychain Syncing error codes";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "SSLv2 padding check: rollback attack detected";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "CSSMERR_CSP_APPLE_SSLv2_ROLLBACK";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "The OpenParameters argument passed to CSSM_DL_DbCreate or CSSM_DL_DbOpen was neither NULL nor a pointer to a valid CSSM_APPLEDL_OPEN_PARAMETERS structure.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "an operation failed because the disk was full";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "an operation failed because a disk quota was exceeded";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "an operation failed because a file was too large";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "a keychain database's internal information (\"blob\") is invalid";

/* CSSMERR_APPLEDL_INVALID_KEY_BLOB */
"-2147412987" = "CSSMERR_APPLEDL_INVALID_KEY_BLOB";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "the internal data format version for a database's internal information (\"blob\") is invalid";

/* CSSMERR_APPLEDL_INCOMPATIBLE_KEY_BLOB */
"-2147412985" = "CSSMERR_APPLEDL_INCOMPATIBLE_KEY_BLOB";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Host name mismatch";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Non-understood extension with Critical flag true";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Basic Constraints extension required per policy, but not present";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "Invalid BasicConstraints.CA";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "Invalid Authority Key ID";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "Invalid Subject Key ID";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Invalid Key Usage for policy";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Invalid Extended Key Usage for policy";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Invalid Subject/Authority Key ID Linkage";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint exceeded";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Cert group terminated at a root cert which did not self-verify";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL expired/not valid yet";

/* CSSMERR_APPLETP_CRL_NOT_VALID_YET */
"-2147408884" = "CSSMERR_APPLETP_CRL_NOT_VALID_YET";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Cannot find appropriate CRL";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "specified CRL server down";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "illegible CRL distribution point URL";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Unknown critical cert/CRL extension";

/* CSSMERR_APPLETP_UNKNOWN_CRL_EXTEN */
"-2147408879" = "CSSMERR_APPLETP_UNKNOWN_CRL_EXTEN";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL not verifiable to anchor or root";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verified to untrusted root";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "CRL failed policy verification";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "IssuingDistributionPoint extension violation";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Cert not found at specified issuerAltName";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Bad cert obtained from specified issuerAltName";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "S/MIME Email address mismatch";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Appropriate S/MIME ExtendedKeyUsage not found";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "S/MIME KeyUsage incompatiblity";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, cert with KeyUsage flagged !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, leaf with empty subject name and no email addrs * in SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, leaf with empty subject name, SubjectAltName * not critical";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Appropriate SSL ExtendedKeyUsage not found";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "unparseable OCSP response";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "unparseable OCSP request";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "OCSP service unavailable";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "OCSP status: cert unrecognized";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "revocation check not successful for each cert";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "general network error";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "OCSP response not verifiable to anchor or root";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "OCSP response verified to untrusted root";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "OCSP response signature error";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "No signer for OCSP response found";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "OCSP responder status: malformed request";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "OCSP responder status: internal error";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "OCSP responder status: try later";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "OCSP responder status: signature required";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "OCSP responder status: unauthorized";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "OCSP response nonce did not match request";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Illegal cert chain length for Code Signing";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Missing Basic Constraints for Code Signing";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Bad PathLengthConstraint for Code Signing";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Missing ExtendedKeyUsage for Code Signing";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Development style Code Signing Cert Detected";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Illegal cert chain length for Resource Signing";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "bad extended key usage for Resource Signing";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Trust Setting: deny";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "invalid empty SubjectName";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "unknown critical Qualified Cert Statement ID";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "cert request queued";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "cert request redirected";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "general server-reported error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "server-reported parameter error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "server-reported authorization error";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "server-reported unimplemented";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "server-reported not available";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "server-reported already exists";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "server-reported service error";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "request already pending for specified user";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "no request pending for specified user";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "CSR failed to verify";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "server reported failed consistency check";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK";

/* errSecCSUnimplemented */
"-67072" = "unimplemented code signing feature";

/* errSecCSInvalidObjectRef */
"-67071" = "invalid API object reference";

/* errSecCSInvalidFlags */
"-67070" = "invalid or inapprpopriate API flag(s) specified";

/* errSecCSObjectRequired */
"-67069" = "a required pointer argument was NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "cannot find code object on disk";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "cannot locate guests using this attribute set";

/* errSecCSInvalidAttributeValues */
"-67066" = "given attribute values are invalid";

/* errSecCSNoSuchCode */
"-67065" = "host has no guest with the requested attributes";

/* errSecCSMultipleGuests */
"-67064" = "host has multiple guests with this attribute value";

/* errSecCSGuestInvalid */
"-67063" = "code identity has been invalidated";

/* errSecCSUnsigned */
"-67062" = "code object is not signed";

/* errSecCSSignatureFailed */
"-67061" = "code or signature modified";

/* errSecCSSignatureNotVerifiable */
"-67060" = "signature cannot be read, e.g., due to a filesystem that maps root to an unprivileged user";

/* errSecCSSignatureUnsupported */
"-67059" = "unsupported type or version of signature";

/* errSecCSBadDictionaryFormat */
"-67058" = "a required plist file or resource is malformed";

/* errSecCSResourcesNotSealed */
"-67057" = "resources are not sealed by signature";

/* errSecCSResourcesNotFound */
"-67056" = "cannot find sealed resources in code";

/* errSecCSResourcesInvalid */
"-67055" = "the sealed resource directory is invalid";

/* errSecCSBadResource */
"-67054" = "a sealed resource is missing or invalid";

/* errSecCSResourceRulesInvalid */
"-67053" = "invalid resource selection rule(s)";

/* errSecCSReqInvalid */
"-67052" = "invalid or corrupted code requirement(s)";

/* errSecCSReqUnsupported */
"-67051" = "unsupported type or version of code requirement(s)";

/* errSecCSReqFailed */
"-67050" = "failed to satisfy code requirement(s)";

/* errSecCSBadObjectFormat */
"-67049" = "object file format invalid or unsuitable";

/* errSecCSInternalError */
"-67048" = "internal error in Code Signing subsystem";

/* errSecCSHostReject */
"-67047" = "code rejected its host";

/* errSecCSNotAHost */
"-67046" = "this code is not a host";

/* errSecCSSignatureInvalid */
"-67045" = "invalid format for signature";

/* errSecCSHostProtocolRelativePath */
"-67044" = "host protocol violation - absolute guest path required";

/* errSecCSHostProtocolContradiction */
"-67043" = "host protocol violation - contradictory hosting modes";

/* errSecCSHostProtocolDedicationError */
"-67042" = "host protocol violation - operation not allowed with/for a dedicated guest";

/* errSecCSHostProtocolNotProxy */
"-67041" = "host protocol violation - proxy hosting not engaged";

/* errSecCSHostProtocolStateError */
"-67040" = "host protocol violation - invalid guest state change request";

/* errSecCSHostProtocolUnrelated */
"-67039" = "host protocol violation - the given guest is not a guest of the given host";

/* errSecCSInvalidOperation */
"-67038" = "requested operation is not valid";

/* errSecCSNotSupported */
"-67037" = "operation not supported for this type of code";

/* errSecCSCMSTooLarge */
"-67036" = "signature too large to embed";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "host protocol violation - invalid guest hash";

/* errSecCSStaticCodeChanged */
"-67034" = "the program on disk does not match what is running";

/* errSecCSSigDBDenied */
"-67033" = "access to signature database denied";

/* errSecCSSigDBAccess */
"-67032" = "cannot access signature database";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "host returned invalid or inconsistent guest attributes";

/* errSecMisc_dskFulErr */
"-34" = "The disk is full.";

/* errSecMisc_nsvErr */
"-35" = "The disk couldn't be found. It may have been ejected.";

/* errSecMisc_bdNamErr */
"-37" = "Tried to open a file whose name contains an illegal character.";

/* errSecMisc_fnfErr */
"-43" = "The file could not be found.";

/* errSecMisc_wPrErr */
"-44" = "The disk is write-protected.";

/* errSecMisc_fLckdErr */
"-45" = "The file is locked.";

/* errSecMisc_vLckdErr */
"-46" = "The volume is locked.";

/* errSecMisc_fBsyErr */
"-47" = "The file is busy. It may be in use by another application.";

/* errSecMisc_dupFNErr */
"-48" = "A file with the same name already exists.";

/* errSecMisc_opWrErr */
"-49" = "The file is already open with write permission.";

/* errSecMisc_volOffLinErr */
"-53" = "The volume is no longer available. It may have been ejected.";

/* errSecMisc_permErr */
"-54" = "The file could not be opened. It may be in use by another application.";

/* errSecMisc_extFSErr */
"-58" = "This volume does not appear to be compatible.";

/* errSecMisc_wrPermErr */
"-61" = "Could not write to the file. It may have been opened with insufficient access privileges.";

/* errSecMisc_offLinErr */
"-65" = "The storage device is no longer available. It may have been ejected.";

/* errSecMisc_memFullErr */
"-108" = "errSecMisc_memFullErr";

/* errSecMisc_dirNFErr */
"-120" = "The directory could not be found.";

/* errSecMisc_volGoneErr */
"-124" = "The server volume is no longer available. It may have been disconnected.";

/* errSecMisc_userCanceledErr */
"-128" = "The operation was cancelled by the user.";

/* errSecMisc_resNotFound */
"-192" = "A required resource could not be found.";

/* errSecMisc_resFNotFound */
"-193" = "A required resource is missing or damaged.";

/* errSecMisc_icNoURLErr */
"-673" = "The specified location (URL) is an unknown type, or does not contain enough information.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "A helper application to open the specified URL could not be found.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "The location (URL) of this item is missing or improperly formatted.";

/* errSecMisc_afpAccessDenied */
"-5000" = "Access to this item was denied.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Authentication failed. The password for this server may have changed since the item was added to the keychain.";

/* errSecMisc_afpPwdPolicyErr */
"-5046" = "errSecMisc_afpPwdPolicyErr";

